app/controllers/api/v1/members_controller.rb

  def create
    member = Member.new(member_params)
    if member.save
---
INSERT INTO "members" ("first_name", "last_name", "gender", "age", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", nil], ["last_name", nil], ["gender", nil], ["age", nil], ["role", nil], ["created_at", "2024-01-29 13:02:47.261775"], ["updated_at", "2024-01-29 13:02:47.261775"]]