app/controllers/api/v1/opportunities_controller.rb

  def index
    opportunities = Opportunity.includes(:doctor, :patient).all
---
SELECT "opportunities".* FROM "opportunities"

  def create
    opportunity = Opportunity.new(opportunity_params.merge(stage_history: [{ stage_name: "Lead", timestamp: Time.now }]))
    if opportunity.save
---
INSERT INTO "opportunities" ("procedure_name", "patient_id", "doctor_id", "stage_history", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    opportunity = Opportunity.find(params[:id])
    if opportunity.update(opportunity_params)
---
SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
UPDATE "opportunities" SET "procedure_name" = $1, "patient_id" = $2, "doctor_id" = $3, "updated_at" = $4 WHERE "opportunities"."id" = $5  [["procedure_name", "test67"], ["patient_id", 40], ["doctor_id", 34], ["updated_at", "2024-01-30 10:00:29.342169"], ["id", 47]]

  def stage_history
    opportunity = Opportunity.find(params[:id])
    if opportunity.update(stage_history_params)
---
SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "opportunities" SET "stage_history" = $1, "updated_at" = $2 WHERE "opportunities"."id" = $3