app/controllers/api/v1/search_controller.rb

        def search
          query = params[:query]
          opportunities = Opportunity.joins("LEFT JOIN members as patients ON opportunities.patient_id = patients.id")
                           .joins("LEFT JOIN members as doctors ON opportunities.doctor_id = doctors.id")
                           .where("procedure_name LIKE :query OR
                                   patients.first_name LIKE :query OR
                                   patients.last_name LIKE :query OR
                                   doctors.first_name LIKE :query OR
                                   doctors.last_name LIKE :query", query: "%#{query}%")
---
SELECT "opportunities".* FROM "opportunities" LEFT JOIN members as patients ON opportunities.patient_id = patients.id LEFT JOIN members as doctors ON opportunities.doctor_id = doctors.id WHERE (procedure_name LIKE '%final%' OR
SELECT "opportunities".* FROM "opportunities" WHERE (procedure_name LIKE '%final%' OR